In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('mystudent_database.db')

In [4]:
cur = con.cursor()

In [5]:
results = cur.execute('select * from student')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [6]:
cur.execute('select id from student')     # replace * by id and only show output id

for i in results:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(7,)
(8,)

In [7]:
cur.execute('select name from student')     # replace * by name and only show output name

for i in results:
    print(i)

('smith',)
('john',)
('jack',)
('john',)
('Lisa',)
('Harry',)
('ABC',)
('DEF',)

In [8]:
cur.execute('select marks from student')     # replace * by marks and only show output marks

for i in results:
    print(i)

(78,)
(75,)
(90,)
(82,)
(88,)
(83,)
(76,)
(94,)

In [9]:
cur.execute('select id,name from student')     # replace * by id and name and only show output id and name

for i in results:
    print(i)

(1, 'smith')
(2, 'john')
(3, 'jack')
(4, 'john')
(5, 'Lisa')
(6, 'Harry')
(7, 'ABC')
(8, 'DEF')

In [10]:
cur.execute('select name,marks from student')     

for i in results:
    print(i)

('smith', 78)
('john', 75)
('jack', 90)
('john', 82)
('Lisa', 88)
('Harry', 83)
('ABC', 76)
('DEF', 94)

In [11]:
cur.execute('select id,marks from student')     

for i in results:
    print(i)

(1, 78)
(2, 75)
(3, 90)
(4, 82)
(5, 88)
(6, 83)
(7, 76)
(8, 94)

In [12]:
cur.execute('select * from student where id=1')     

for i in results:
    print(i)

(1, 'smith', 78)

In [13]:
cur.execute('select * from student where id=2')     

for i in results:
    print(i)

(2, 'john', 75)

In [14]:
cur.execute('select * from student where id=7')     

for i in results:
    print(i)

(7, 'ABC', 76)

In [15]:
results = cur.execute('select * from student where name="Lisa"')     

for i in results:
    print(i)

(5, 'Lisa', 88)

In [16]:
results = cur.execute('select * from student where name="Harry"')     

for i in results:
    print(i)

(6, 'Harry', 83)

In [17]:
results = cur.execute('select marks from student where name="Lisa"')     

for i in results:
    print(i)

(88,)

In [18]:
results = cur.execute('select id from student where name="Lisa"')     

for i in results:
    print(i)

(5,)

In [19]:
results = cur.execute('select * from student')     

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [20]:
results = cur.execute('select * from student limit 3')     

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)

In [21]:
results = cur.execute('select * from student limit 5')     

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)

In [22]:
results = cur.execute('select * from student where id in (1,2)')     

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)

In [23]:
results = cur.execute('select * from student where id in (1,2,5)')     

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(5, 'Lisa', 88)

In [24]:
results = cur.execute('select * from student where id = 1 and name = "smith"')     

for i in results:
    print(i)

(1, 'smith', 78)

In [25]:
results = cur.execute('select * from student where id = 1 and name = "john"')     # here no output because john doesn't inside id 1 that why here no output.

for i in results:
    print(i)

In [26]:
results = cur.execute('select * from student where id = 8 and name = "DEF"')

for i in results:
    print(i)

(8, 'DEF', 94)

In [27]:
results = cur.execute('select * from student where id = 15 and name = "DEF"')   # id 15 is wrong that's why doesn't show any data.

for i in results:
    print(i)

In [28]:
results = cur.execute('select * from student ')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [29]:
results = cur.execute('select * from student where id = 1 or name = "Harry"')   # here two output is given because id 1 is correct and harry is also our list and we use here or operator.

for i in results:
    print(i)

(1, 'smith', 78)
(6, 'Harry', 83)

In [30]:
results = cur.execute('select * from student where id = 1 or name = "Adam"')    # here only one output because adam is not our list 

for i in results:
    print(i)

(1, 'smith', 78)

In [31]:
results = cur.execute('select * from student where id = 20 or name = "Harry"')

for i in results:
    print(i)

(6, 'Harry', 83)

In [32]:
results = cur.execute('select * from student where id = 20 or marks = 83')

for i in results:
    print(i)

(6, 'Harry', 83)

In [33]:
results = cur.execute('select * from student')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [34]:
results = cur.execute('select * from student where name is null')   # because name are filled that's why doesn't show any data in output.

for i in results:
    print(i)

In [35]:
results = cur.execute('select * from student where name is NOT null')   # because name are filled that's why doesn't show any data in output.

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [36]:
results = cur.execute('select * from student where marks>80')

for i in results:
    print(i)

(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(8, 'DEF', 94)

In [37]:
results = cur.execute('select * from student where marks<80')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(7, 'ABC', 76)

In [38]:
results = cur.execute('select * from student where marks>90')

for i in results:
    print(i)

(8, 'DEF', 94)

In [39]:
results = cur.execute('select * from student where marks>75 and marks<85')

for i in results:
    print(i)

(1, 'smith', 78)
(4, 'john', 82)
(6, 'Harry', 83)
(7, 'ABC', 76)

In [40]:
results = cur.execute('select * from student where marks between 75 and 85')    # here between is also work like operator.

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(4, 'john', 82)
(6, 'Harry', 83)
(7, 'ABC', 76)

In [41]:
results = cur.execute('select * from student where id between 1 and 4 ')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)

In [42]:
results = cur.execute('select * from student order by name asc')

for i in results:
    print(i)

(7, 'ABC', 76)
(8, 'DEF', 94)
(6, 'Harry', 83)
(5, 'Lisa', 88)
(3, 'jack', 90)
(2, 'john', 75)
(4, 'john', 82)
(1, 'smith', 78)

In [43]:
results = cur.execute('select * from student order by name desc')

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(4, 'john', 82)
(3, 'jack', 90)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(8, 'DEF', 94)
(7, 'ABC', 76)

In [44]:
results = cur.execute('select * from student order by marks desc')

for i in results:
    print(i)

(8, 'DEF', 94)
(3, 'jack', 90)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(4, 'john', 82)
(1, 'smith', 78)
(7, 'ABC', 76)
(2, 'john', 75)

In [45]:
results = cur.execute('select * from student order by id desc')

for i in results:
    print(i)

(8, 'DEF', 94)
(7, 'ABC', 76)
(6, 'Harry', 83)
(5, 'Lisa', 88)
(4, 'john', 82)
(3, 'jack', 90)
(2, 'john', 75)
(1, 'smith', 78)

In [46]:
results = cur.execute('select * from student')

results.fetchall()

[(1, 'smith', 78),
 (2, 'john', 75),
 (3, 'jack', 90),
 (4, 'john', 82),
 (5, 'Lisa', 88),
 (6, 'Harry', 83),
 (7, 'ABC', 76),
 (8, 'DEF', 94)]

In [47]:
results = cur.execute('select * from student')

results.fetchone()

(1, 'smith', 78)

# Aggregate functions

In [48]:
results = cur.execute('select min(marks) from student')

for i in results:
    print(i)

(75,)

In [49]:
results = cur.execute('select max(marks) from student')

results.fetchone()

(94,)

In [50]:
results = cur.execute('select min(marks) from student')

results.fetchall()

[(75,)]

In [51]:
results = cur.execute('select max(marks) from student')

results.fetchall()

[(94,)]

In [52]:
results = cur.execute('select avg(marks) from student')

for i in results:
    print(i)

(83.25,)

In [53]:
results = cur.execute('select sum(marks) from student')

results.fetchone()

(666,)

In [54]:
results = cur.execute('select count(id) from student')

results.fetchone()

(8,)

In [55]:
results = cur.execute('select * from student where name LIKE "%a%"')   # how much a in data show that data

for i in results:
    print(i)

(3, 'jack', 90)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)

In [56]:
results = cur.execute('select * from student where name LIKE "%s%"')

for i in results:
    print(i)

(1, 'smith', 78)
(5, 'Lisa', 88)

In [57]:
results = cur.execute('select * from student where name LIKE "%j%"')

for i in results:
    print(i)

(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)

In [60]:
results = cur.execute('select * from student where name LIKE "%rr%"')

for i in results:
    print(i)

(6, 'Harry', 83)

In [63]:
results = cur.execute('select * from student where name LIKE "%is%"')

for i in results:
    print(i)

(5, 'Lisa', 88)

In [64]:
results = cur.execute('select * from student where name LIKE "_a%"')  # here _ is the first character and second character is a it means first character is anything but second character is a.

for i in results:
    print(i)

(3, 'jack', 90)
(6, 'Harry', 83)

In [65]:
results = cur.execute('select * from student where name LIKE "__c%"') # here third character is c 

for i in results:
    print(i)

(3, 'jack', 90)
(7, 'ABC', 76)

In [66]:
results = cur.execute('select * from student where name LIKE "_a__"') # here second character is a 

for i in results:
    print(i)

(3, 'jack', 90)

In [68]:
results = cur.execute('select * from student where name LIKE "_o__"') # here second character is o

for i in results:
    print(i)

(2, 'john', 75)
(4, 'john', 82)

In [69]:
results = cur.execute('select * from student where name LIKE "j___"') # here first character is j

for i in results:
    print(i)

(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)

In [71]:
# display only 4 character
results = cur.execute("select * from student where name like '____'")

for i in results:
    print(i)

(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)

In [72]:
results = cur.execute("select * from student where marks NOT in (70)")

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [73]:
results = cur.execute("select * from student where name NOT in ('Kim')")

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [74]:
results = cur.execute("select * from student where name NOT in ('smith')")

for i in results:
    print(i)

(2, 'john', 75)
(3, 'jack', 90)
(4, 'john', 82)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [75]:
results = cur.execute("select * from student where name in ('john')")

for i in results:
    print(i)

(2, 'john', 75)
(4, 'john', 82)

In [76]:
results = cur.execute("select * from student where name IN ('smith','john')")

for i in results:
    print(i)

(1, 'smith', 78)
(2, 'john', 75)
(4, 'john', 82)

In [77]:
results = cur.execute("select * from student where name NOT in ('john')")

for i in results:
    print(i)

(1, 'smith', 78)
(3, 'jack', 90)
(5, 'Lisa', 88)
(6, 'Harry', 83)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [78]:
results = cur.execute("select * from student where marks in (90,88,83)")  # only 90 is avaliable in our data

for i in results:
    print(i)

(3, 'jack', 90)
(5, 'Lisa', 88)
(6, 'Harry', 83)

In [79]:
cur.execute('update student set name = "META" where id = 4 ')
con.commit()

In [80]:
results = cur.execute('select * from student')

results.fetchall()

[(1, 'smith', 78),
 (2, 'john', 75),
 (3, 'jack', 90),
 (4, 'META', 82),
 (5, 'Lisa', 88),
 (6, 'Harry', 83),
 (7, 'ABC', 76),
 (8, 'DEF', 94)]

In [92]:
# update the record

sql="update student set marks = 81 where id = 4"
cur.execute(sql)

In [93]:
results = cur.execute('select * from student where id = 4')
for row in results:
    print(row)

(4, 'META', 81)

In [94]:
results = cur.execute("select * from student")
for row in results:
    print(row)

(1, 'smith', 92)
(2, 'john', 92)
(3, 'jack', 90)
(4, 'META', 81)
(5, 'Lisa', 68)
(6, 'Harry', 68)
(7, 'ABC', 76)
(8, 'DEF', 94)

In [95]:
# multiple record update

sql = "update student set marks=92 where id in(1,2)"
cur.execute(sql)

results = cur.execute("select * from student")for row in results:print(row)

In [91]:
sql = "UPDATE student SET marks = 68 where id IN (5,6)"
cur.execute(sql)
# verify if its updated
results = cur.execute("SELECT * from student")
for row in results:
    print(row)

(1, 'smith', 92)
(2, 'john', 92)
(3, 'jack', 90)
(4, 'META', 81)
(5, 'Lisa', 68)
(6, 'Harry', 68)
(7, 'ABC', 76)
(8, 'DEF', 94)

# Delete any unwanted records

In [96]:
sql = "delete from student where id=6"
cur.execute(sql)

In [97]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'smith', 92),
 (2, 'john', 92),
 (3, 'jack', 90),
 (4, 'META', 81),
 (5, 'Lisa', 68),
 (7, 'ABC', 76),
 (8, 'DEF', 94)]

In [98]:
cur.execute('delete from student where id = 8')
con.execute(sql)

In [99]:
results=cur.execute('select * from student')  # let us see here id 6 and id 8 are deleted
results.fetchall()

[(1, 'smith', 92),
 (2, 'john', 92),
 (3, 'jack', 90),
 (4, 'META', 81),
 (5, 'Lisa', 68),
 (7, 'ABC', 76)]

In [100]:
cur.execute('drop table student')
con.commit()

In [101]:
results = cur.execute('select * from student')  # here code is error because above cell we was use drop that's why now this code is error

results.fetchall()

OperationalError: no such table: student